using System;

namespace _04.ThreeColumn
{
    class Startup
    {
        static void Main()
        {
            Console.Write("\n{0,-10:X}{1,-10:F2}{2,-10:F2}\n\n", 56, 0.532f, -3.879f);
        }
    }
}


    //Напишете програма, която отпечатва три числа в три виртуални колони на конзолата.
    //Всяка колона трябва да е с широчина 10 символа, а числата трябва да са ляво подравнени.
    //Първото число трябва да е цяло число в шестнадесетична бройна система, второто да е дробно положи-телно, а третото да е дробно отрицателно.
    //Последните две числа да се закръглят до втория знак след десетичната запетая.